app/controllers/hybrid_posts_controller.rb

  def index
    @hybrid_posts = HybridPost.all
---
SELECT "hybrid_posts".* FROM "hybrid_posts"

  def create
    @hybrid_post = HybridPost.new(hybrid_post_params)

    respond_to do |format|
      if @hybrid_post.save
---
INSERT INTO "hybrid_posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "testing hybrid posts"], ["content", "test test test"], ["created_at", "2019-06-26 00:34:46.565023"], ["updated_at", "2019-06-26 00:34:46.565023"]]

    def set_hybrid_post
      @hybrid_post = HybridPost.find(params[:id])
---
SELECT  "hybrid_posts".* FROM "hybrid_posts" WHERE "hybrid_posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]