app/controllers/rails_posts_controller.rb

  def index
    @rails_posts = RailsPost.all
---
SELECT "rails_posts".* FROM "rails_posts"

  def create
    @rails_post = RailsPost.new(rails_post_params)

    respond_to do |format|
      if @rails_post.save
---
INSERT INTO "rails_posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "testing Rails-only Form"], ["content", ""], ["created_at", "2019-06-26 00:33:09.616346"], ["updated_at", "2019-06-26 00:33:09.616346"]]

  def update
    respond_to do |format|
      if @rails_post.update(rails_post_params)
---
UPDATE "rails_posts" SET "content" = $1, "updated_at" = $2 WHERE "rails_posts"."id" = $3  [["content", "test test test"], ["updated_at", "2019-06-26 00:33:17.727989"], ["id", 1]]

    def set_rails_post
      @rails_post = RailsPost.find(params[:id])
---
SELECT  "rails_posts".* FROM "rails_posts" WHERE "rails_posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]