app/controllers/react_posts_controller.rb

SELECT "react_posts".* FROM "react_posts"
---
  def index
    @react_posts = ReactPost.all

INSERT INTO "react_posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "testing react only form"], ["content", "test test test"], ["created_at", "2019-06-26 00:33:41.046208"], ["updated_at", "2019-06-26 00:33:41.046208"]]
---
  def create
    @react_post = ReactPost.new(react_post_params)

    respond_to do |format|
      if @react_post.save

DELETE FROM "react_posts" WHERE "react_posts"."id" = $1  [["id", 3]]
---
  def destroy
    @react_post.destroy

SELECT  "react_posts".* FROM "react_posts" WHERE "react_posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_react_post
      @react_post = ReactPost.find(params[:id])